{
  "AAPL": {
    "symbol": "AAPL",
    "name": "Apple Inc.",
    "companyName": "Apple Inc.",
    "price": 264.58,
    "change": 4,
    "changesPercentage": 1.53504,
    "marketCap": 3888777185410,
    "pe": 0,
    "pbr": 0,
    "dividend": 1.04,
    "sector": "Technology",
    "industry": "Consumer Electronics",
    "ceo": "Timothy D. Cook",
    "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.",
    "exchange": "NASDAQ",
    "website": "https://www.apple.com",
    "image": "https://images.financialmodelingprep.com/symbol/AAPL.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 288.62,
    "yearLow": 169.21,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 36737067,
    "avgVolume": 48701543,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "MSFT": {
    "symbol": "MSFT",
    "name": "Microsoft Corporation",
    "companyName": "Microsoft Corporation",
    "price": 397.23,
    "change": -1.23,
    "changesPercentage": -0.30869,
    "marketCap": 2949683004900,
    "pe": 0,
    "pbr": 0,
    "dividend": 3.4,
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "ceo": "Satya Nadella",
    "description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Skype for Business; Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. The Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related Client Access Licenses; GitHub that provides a collaboration platform and code hosting service for developers; Nuance provides healthcare and enterprise AI solutions; and Azure, a cloud platform. It also offers enterprise support, Microsoft consulting, and nuance professional services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. The More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. Microsoft Corporation was founded in 1975 and is headquartered in Redmond, Washington.",
    "exchange": "NASDAQ",
    "website": "https://www.microsoft.com",
    "image": "https://images.financialmodelingprep.com/symbol/MSFT.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 555.45,
    "yearLow": 344.79,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 31825617,
    "avgVolume": 31248728,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "NVDA": {
    "symbol": "NVDA",
    "name": "NVIDIA Corporation",
    "companyName": "NVIDIA Corporation",
    "price": 189.82,
    "change": 1.92,
    "changesPercentage": 1.02182,
    "marketCap": 4621547537343,
    "pe": 0,
    "pbr": 0,
    "dividend": 0.04,
    "sector": "Technology",
    "industry": "Semiconductors",
    "ceo": "Jen-Hsun Huang",
    "description": "NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds. Its Compute & Networking segment provides Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; cryptocurrency mining processors; Jetson for robotics and other embedded platforms; and NVIDIA AI Enterprise and other software. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, independent software vendors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. It has a strategic collaboration with Kroger Co. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.",
    "exchange": "NASDAQ",
    "website": "https://www.nvidia.com",
    "image": "https://images.financialmodelingprep.com/symbol/NVDA.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 212.19,
    "yearLow": 86.62,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 171532711,
    "avgVolume": 179983561,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "GOOGL": {
    "symbol": "GOOGL",
    "name": "Alphabet Inc.",
    "companyName": "Alphabet Inc.",
    "price": 314.98,
    "change": 12.13,
    "changesPercentage": 4.00528,
    "marketCap": 3810313063780,
    "pe": 0,
    "pbr": 0,
    "dividend": 0.83,
    "sector": "Technology",
    "industry": "Internet Content & Information",
    "ceo": "Sundar Pichai",
    "description": "Alphabet Inc. provides various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment offers products and services, including ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play store; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in the provision of YouTube non-advertising services. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services. The company was founded in 1998 and is headquartered in Mountain View, California.",
    "exchange": "NASDAQ",
    "website": "https://www.abc.xyz",
    "image": "https://images.financialmodelingprep.com/symbol/GOOGL.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 349,
    "yearLow": 140.53,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 51937895,
    "avgVolume": 38311085,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "AMZN": {
    "symbol": "AMZN",
    "name": "Amazon.com, Inc.",
    "companyName": "Amazon.com, Inc.",
    "price": 210.11,
    "change": 5.25,
    "changesPercentage": 2.56273,
    "marketCap": 2255509839000,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Consumer Cyclical",
    "industry": "Specialty Retail",
    "ceo": "Andrew R. Jassy",
    "description": "Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). Its products offered through its stores include merchandise and content purchased for resale; and products offered by third-party sellers The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, Blink, eero, and Echo; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products in its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program. The company serves consumers, sellers, developers, enterprises, content creators, and advertisers. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
    "exchange": "NASDAQ",
    "website": "https://www.amazon.com",
    "image": "https://images.financialmodelingprep.com/symbol/AMZN.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 258.6,
    "yearLow": 161.38,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 63898535,
    "avgVolume": 46995661,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "META": {
    "symbol": "META",
    "name": "Meta Platforms, Inc.",
    "companyName": "Meta Platforms, Inc.",
    "price": 655.66,
    "change": 10.88,
    "changesPercentage": 1.6874,
    "marketCap": 1652914250055,
    "pe": 0,
    "pbr": 0,
    "dividend": 2.1,
    "sector": "Technology",
    "industry": "Internet Content & Information",
    "ceo": "Mark Elliot Zuckerberg",
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was incorporated in 2004 and is headquartered in Menlo Park, California.",
    "exchange": "NASDAQ",
    "website": "https://investor.fb.com",
    "image": "https://images.financialmodelingprep.com/symbol/META.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 796.25,
    "yearLow": 479.8,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 14057273,
    "avgVolume": 16900360,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "BRK-B": {
    "symbol": "BRK-B",
    "name": "Berkshire Hathaway Inc.",
    "companyName": "Berkshire Hathaway Inc.",
    "price": 498.25,
    "change": 1.31,
    "changesPercentage": 0.26361,
    "marketCap": 1074892044668,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "ceo": "Gregory Edward Abel",
    "description": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses worldwide. The company provides property, casualty, life, accident, and health insurance and reinsurance; and operates railroad systems in North America. It also generates, transmits, stores, and distributes electricity from natural gas, coal, wind, solar, hydroelectric, nuclear, and geothermal sources; operates natural gas distribution and storage facilities, interstate pipelines, liquefied natural gas facilities, and compressor and meter stations; and holds interest in coal mining assets. In addition, the company manufactures boxed chocolates and other confectionery products; specialty chemicals, metal cutting tools, and components for aerospace and power generation applications; flooring products; insulation, roofing, and engineered products; building and engineered components; paints and coatings; and bricks and masonry products, as well as offers manufactured and site-built home construction, and related lending and financial services. Further, it provides recreational vehicles, apparel and footwear products, jewelry, and custom picture framing products, as well as alkaline batteries; castings, forgings, fasteners/fastener systems, aerostructures, and precision components; and cobalt, nickel, and titanium alloys. Additionally, the company distributes televisions and information; franchises and services quick service restaurants; distributes electronic components; and offers logistics services, grocery and foodservice distribution services, and professional aviation training and shared aircraft ownership programs. It also retails automobiles; furniture, bedding, and accessories; household appliances, electronics, and computers; jewelry, watches, crystal, china, stemware, flatware, gifts, and collectibles; kitchenware; and motorcycle clothing and equipment. The company was incorporated in 1998 and is headquartered in Omaha, Nebraska.",
    "exchange": "NYSE",
    "website": "https://www.berkshirehathaway.com",
    "image": "https://images.financialmodelingprep.com/symbol/BRK-B.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 542.07,
    "yearLow": 455.19,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 3695886,
    "avgVolume": 4861216,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "TSLA": {
    "symbol": "TSLA",
    "name": "Tesla, Inc.",
    "companyName": "Tesla, Inc.",
    "price": 411.82,
    "change": 0.10999,
    "changesPercentage": 0.02671576,
    "marketCap": 1545326539651,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Consumer Cyclical",
    "industry": "Auto - Manufacturers",
    "ceo": "Elon R. Musk",
    "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. It operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
    "exchange": "NASDAQ",
    "website": "https://www.tesla.com",
    "image": "https://images.financialmodelingprep.com/symbol/TSLA.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 498.83,
    "yearLow": 214.25,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 57670925,
    "avgVolume": 69357566,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "UNH": {
    "symbol": "UNH",
    "name": "UnitedHealth Group Incorporated",
    "companyName": "UnitedHealth Group Incorporated",
    "price": 290,
    "change": 0.07,
    "changesPercentage": 0.02414376,
    "marketCap": 262693199800,
    "pe": 0,
    "pbr": 0,
    "dividend": 8.73,
    "sector": "Healthcare",
    "industry": "Medical - Healthcare Plans",
    "ceo": "Stephen J. Hemsley",
    "description": "UnitedHealth Group Incorporated operates as a diversified health care company in the United States. It operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage and well-being services to individuals age 50 and older addressing their needs for preventive and acute health care services, as well as services dealing with chronic disease and other specialized issues for older individuals; Medicaid plans, children's health insurance and health care programs; health and dental benefits; and hospital and clinical services. The OptumHealth segment provides access to networks of care provider specialists, health management services, care delivery, consumer engagement, and financial services. This segment serves individuals directly through care delivery systems, employers, payers, and government entities. The OptumInsight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The OptumRx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and compounding pharmacy, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease/drug therapy management. UnitedHealth Group Incorporated was incorporated in 1977 and is based in Minnetonka, Minnesota.",
    "exchange": "NYSE",
    "website": "https://www.unitedhealthgroup.com",
    "image": "https://images.financialmodelingprep.com/symbol/UNH.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 606.36,
    "yearLow": 234.6,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 6783641,
    "avgVolume": 8798040,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "LLY": {
    "symbol": "LLY",
    "name": "Eli Lilly and Company",
    "companyName": "Eli Lilly and Company",
    "price": 1009.52,
    "change": -13.7,
    "changesPercentage": -1.33891,
    "marketCap": 952337758640,
    "pe": 0,
    "pbr": 0,
    "dividend": 6.23,
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "ceo": "David A. Ricks",
    "description": "Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. It offers Basaglar, Humalog, Humalog Mix 75/25, Humalog U-100, Humalog U-200, Humalog Mix 50/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75/25, Humulin, Humulin 70/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; and Jardiance, Trajenta, and Trulicity for type 2 diabetes. The company provides Alimta for non-small cell lung cancer (NSCLC) and malignant pleural mesothelioma; Cyramza for metastatic gastric cancer, gastro-esophageal junction adenocarcinoma, metastatic NSCLC, metastatic colorectal cancer, and hepatocellular carcinoma; Erbitux for colorectal cancers, and various head and neck cancers; Retevmo for metastatic NSCLC, medullary thyroid cancer, and thyroid cancer; Tyvyt for relapsed or refractory classic Hodgkin's lymph and non-squamous NSCLC; and Verzenio for HR+, HER2- metastatic breast cancer, node positive, and early breast cancer. It offers Olumiant for rheumatoid arthritis; and Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis. The company offers Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Emgality for migraine prevention and episodic cluster headache; and Zyprexa for schizophrenia, bipolar I disorder, and bipolar maintenance. Its Bamlanivimab and etesevimab, and Bebtelovimab for COVID-19; Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. The company has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; AbCellera Biologics Inc.; Junshi Biosciences; Regor Therapeutics Group; Lycia Therapeutics, Inc.; Kumquat Biosciences Inc.; Entos Pharmaceuticals Inc.; and Foghorn Therapeutics Inc. Eli Lilly and Company was founded in 1876 and is headquartered in Indianapolis, Indiana.",
    "exchange": "NYSE",
    "website": "https://www.lilly.com",
    "image": "https://images.financialmodelingprep.com/symbol/LLY.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 1133.95,
    "yearLow": 623.78,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 3137332,
    "avgVolume": 3545592,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "JPM": {
    "symbol": "JPM",
    "name": "JPMorgan Chase & Co.",
    "companyName": "JPMorgan Chase & Co.",
    "price": 310.79,
    "change": 2.74,
    "changesPercentage": 0.88947,
    "marketCap": 846051884056,
    "pe": 0,
    "pbr": 0,
    "dividend": 5.8,
    "sector": "Financial Services",
    "industry": "Banks - Diversified",
    "ceo": "James Dimon",
    "description": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers s deposit, investment and lending products, payments, and services to consumers; lending, deposit, and cash management and payment solutions to small businesses; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit card, auto loan, and leasing services. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt markets capital-raising services, as well as loan origination and syndication; payments and cross-border financing; and cash and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, payments, investment banking, and asset management to small business, large and midsized companies, local governments, and nonprofit clients; and commercial real estate banking services to investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, trusts and estates, loans, mortgages, deposits, and investment management products. The company also provides ATM, online and mobile, and telephone banking services. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
    "exchange": "NYSE",
    "website": "https://www.jpmorganchase.com",
    "image": "https://images.financialmodelingprep.com/symbol/JPM.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 337.25,
    "yearLow": 202.16,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 7242022,
    "avgVolume": 10537205,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "XOM": {
    "symbol": "XOM",
    "name": "Exxon Mobil Corporation",
    "companyName": "Exxon Mobil Corporation",
    "price": 147.28,
    "change": -3.69,
    "changesPercentage": -2.44419,
    "marketCap": 621104122321,
    "pe": 0,
    "pbr": 0,
    "dividend": 4.04,
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "ceo": "Darren W. Woods",
    "description": "Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States and internationally. It operates through Upstream, Downstream, and Chemical segments. The company is also involved in the manufacture, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; manufactures and sells petrochemicals, including olefins, polyolefins, aromatics, and various other petrochemicals; and captures and stores carbon, hydrogen, and biofuels. As of December 31, 2021, it had approximately 20,528 net operated wells with proved reserves. The company was founded in 1870 and is headquartered in Irving, Texas.",
    "exchange": "NYSE",
    "website": "https://corporate.exxonmobil.com",
    "image": "https://images.financialmodelingprep.com/symbol/XOM.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 156.93,
    "yearLow": 97.8,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 24264148,
    "avgVolume": 18391103,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "V": {
    "symbol": "V",
    "name": "Visa Inc.",
    "companyName": "Visa Inc.",
    "price": 320.95,
    "change": 2.02,
    "changesPercentage": 0.63337,
    "marketCap": 618804303843,
    "pe": 0,
    "pbr": 0,
    "dividend": 2.68,
    "sector": "Financial Services",
    "industry": "Financial - Credit Services",
    "ceo": "Ryan McInerney",
    "description": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. Visa Inc. has a strategic agreement with Ooredoo to provide an enhanced payment experience for Visa cardholders and Ooredoo customers in Qatar. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
    "exchange": "NYSE",
    "website": "https://usa.visa.com",
    "image": "https://images.financialmodelingprep.com/symbol/V.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 375.51,
    "yearLow": 299,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 6784680,
    "avgVolume": 7528371,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "JNJ": {
    "symbol": "JNJ",
    "name": "Johnson & Johnson",
    "companyName": "Johnson & Johnson",
    "price": 242.49,
    "change": -4.42,
    "changesPercentage": -1.79013,
    "marketCap": 584376392991,
    "pe": 0,
    "pbr": 0,
    "dividend": 3.9,
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "ceo": "Joaquin Duato",
    "description": "Johnson & Johnson, together with its subsidiaries, researches and develops, manufactures, and sells various products in the healthcare field worldwide, but strategically separated its Consumer Health business into Kenvue Inc. in 2023 to focus on its higher-growth, innovation-driven segments; the former Consumer Health brands (including TYLENOL, LISTERINE, and BAND-AID) are now owned by Kenvue. The company's core focus is now split between its Innovative Medicine (formerly Pharmaceutical) segment, which offers prescription products for complex diseases such as rheumatoid arthritis, various cancers, HIV/AIDS, and neurodegenerative disorders; and its MedTech (Medical Devices) segment, which provides advanced technology solutions including electrophysiology products, neurovascular care products, orthopaedics (hips, knees, spine), advanced surgery solutions, and disposable contact lenses under the ACUVUE brand. Company's two remaining segments primarily serve hospitals, healthcare professionals, wholesalers, and retailers, continuing its mission of advancing human health since its founding in 1886 and its current basing in New Brunswick, New Jersey.",
    "exchange": "NYSE",
    "website": "https://www.jnj.com",
    "image": "https://images.financialmodelingprep.com/symbol/JNJ.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 246.88,
    "yearLow": 141.5,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 12823464,
    "avgVolume": 9121536,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "PG": {
    "symbol": "PG",
    "name": "The Procter & Gamble Company",
    "companyName": "The Procter & Gamble Company",
    "price": 160.78,
    "change": 2.22,
    "changesPercentage": 1.4001,
    "marketCap": 375700020008,
    "pe": 0,
    "pbr": 0,
    "dividend": 4.2272,
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "ceo": "Shailesh G. Jejurikar",
    "description": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and appliances under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, taped diapers, and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. The company sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
    "exchange": "NYSE",
    "website": "https://www.pginvestor.com",
    "image": "https://images.financialmodelingprep.com/symbol/PG.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 179.99,
    "yearLow": 137.62,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 11097069,
    "avgVolume": 11175193,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "MA": {
    "symbol": "MA",
    "name": "Mastercard Incorporated",
    "companyName": "Mastercard Incorporated",
    "price": 526.41,
    "change": 6.15,
    "changesPercentage": 1.1821,
    "marketCap": 469788130183,
    "pe": 0,
    "pbr": 0,
    "dividend": 3.15,
    "sector": "Financial Services",
    "industry": "Financial - Credit Services",
    "ceo": "Michael Miebach",
    "description": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers other payment-related products and services. The company offers integrated products and value-added services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; prepaid programs and management services; commercial credit and debit payment products and solutions; and payment products and solutions that allow its customers to access funds in deposit and other accounts. It also provides value-added products and services comprising cyber and intelligence solutions for parties to transact, as well as proprietary insights, drawing on principled use of consumer, and merchant data services. In addition, the company offers analytics, test and learn, consulting, managed services, loyalty, processing, and payment gateway solutions for e-commerce merchants. Further, it provides open banking and digital identity platforms services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "exchange": "NYSE",
    "website": "https://www.mastercard.com",
    "image": "https://images.financialmodelingprep.com/symbol/MA.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 601.77,
    "yearLow": 465.59,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 2737909,
    "avgVolume": 3502411,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "AVGO": {
    "symbol": "AVGO",
    "name": "Broadcom Inc.",
    "companyName": "Broadcom Inc.",
    "price": 332.65,
    "change": -1.34,
    "changesPercentage": -0.40121,
    "marketCap": 1577184729237,
    "pe": 0,
    "pbr": 0,
    "dividend": 2.42,
    "sector": "Technology",
    "industry": "Semiconductors",
    "ceo": "Hock E. Tan",
    "description": "Broadcom, Inc. is a global technology company, which designs, develops and supplies semiconductor and infrastructure software solutions. The company is headquartered in San Jose, California and currently employs 19,000 full-time employees. The firm operates through four segments: Wired Infrastructure, Wireless Communications, Enterprise Storage, and Industrial & Other. The company offers a range of products that are used in end-products, such as enterprise and data center networking, home connectivity, set-top boxes, telecommunication equipment, smartphones, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Its product portfolio ranges from discrete devices to complex sub-systems that include multiple device types, and also includes firmware for interfacing between analog and digital systems. Its products include mechanical hardware that interfaces with optoelectronic or capacitive sensors.",
    "exchange": "NASDAQ",
    "website": "https://www.broadcom.com",
    "image": "https://images.financialmodelingprep.com/symbol/AVGO.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 414.61,
    "yearLow": 138.1,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 16328571,
    "avgVolume": 31734290,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "HD": {
    "symbol": "HD",
    "name": "The Home Depot, Inc.",
    "companyName": "The Home Depot, Inc.",
    "price": 382.25,
    "change": 3.67,
    "changesPercentage": 0.96941,
    "marketCap": 380534079750,
    "pe": 0,
    "pbr": 0,
    "dividend": 9.2,
    "sector": "Consumer Cyclical",
    "industry": "Home Improvement",
    "ceo": "Edward Decker",
    "description": "The Home Depot, Inc. operates as a home improvement retailer. It operates The Home Depot stores that sell various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products The company also offers installation services for flooring, cabinets and cabinet makeovers, countertops, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company primarily serves homeowners; and professional renovators/remodelers, general contractors, maintenance professionals, handymen, property managers, building service contractors, and specialty tradesmen, such as electricians, plumbers, and painters. It also sells its products through websites, including homedepot.com; blinds.com, an online site for custom window coverings; and thecompanystore.com, an online site for textiles and décor products. As of December 31, 2021, the company operated 2,317 stores in the United States. The Home Depot, Inc. was incorporated in 1978 and is based in Atlanta, Georgia.",
    "exchange": "NYSE",
    "website": "https://www.homedepot.com",
    "image": "https://images.financialmodelingprep.com/symbol/HD.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 426.75,
    "yearLow": 326.31,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 3877545,
    "avgVolume": 4669856,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "MRK": {
    "symbol": "MRK",
    "name": "Merck & Co., Inc.",
    "companyName": "Merck & Co., Inc.",
    "price": 122.26,
    "change": 0.4,
    "changesPercentage": 0.32825,
    "marketCap": 305378988581,
    "pe": 0,
    "pbr": 0,
    "dividend": 3.28,
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "ceo": "Robert Davis",
    "description": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes, as well as vaccine products, such as preventive pediatric, adolescent, and adult vaccines. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. It serves drug wholesalers and retailers, hospitals, and government agencies; managed health care providers, such as health maintenance organizations, pharmacy benefit managers, and other institutions; and physicians and physician distributors, veterinarians, and animal producers. The company has collaborations with AstraZeneca PLC; Bayer AG; Eisai Co., Ltd.; Ridgeback Biotherapeutics; and Gilead Sciences, Inc. to jointly develop and commercialize long-acting treatments in HIV. Merck & Co., Inc. was founded in 1891 and is headquartered in Kenilworth, New Jersey.",
    "exchange": "NYSE",
    "website": "https://www.merck.com",
    "image": "https://images.financialmodelingprep.com/symbol/MRK.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 123.33,
    "yearLow": 73.31,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 9058698,
    "avgVolume": 14575891,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "COST": {
    "symbol": "COST",
    "name": "Costco Wholesale Corporation",
    "companyName": "Costco Wholesale Corporation",
    "price": 985.27,
    "change": -2.55,
    "changesPercentage": -0.25814,
    "marketCap": 437331214576,
    "pe": 0,
    "pbr": 0,
    "dividend": 5.2,
    "sector": "Consumer Defensive",
    "industry": "Discount Stores",
    "ceo": "Ron Vachris",
    "description": "Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, the United Kingdom, Mexico, Japan, Korea, Australia, Spain, France, Iceland, China, and Taiwan. It offers branded and private-label products in a range of merchandise categories. The company offers sundries, dry groceries, candies, coolers, freezers, liquor, and tobacco and deli products; appliances, electronics, health and beauty aids, hardware, garden and patio products, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. It also operates pharmacies, opticals, food courts, hearing-aid centers, and tire installation centers, as well as 636 gas stations; and offers business delivery, travel, same-day grocery, and various other services online in various countries. As of August 29, 2021, the company operated 815 membership warehouses, including 564 in the United States and Puerto Rico, 105 in Canada, 39 in Mexico, 30 in Japan, 29 in the United Kingdom, 16 in South Korea, 14 in Taiwan, 12 in Australia, 3 in Spain, 1 in Iceland, 1 in France, and 1 in China. It also operates e-commerce websites in the United States, Canada, the United Kingdom, Mexico, South Korea, Taiwan, Japan, and Australia. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.",
    "exchange": "NASDAQ",
    "website": "https://www.costco.com",
    "image": "https://images.financialmodelingprep.com/symbol/COST.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 1071,
    "yearLow": 844.06,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 1527696,
    "avgVolume": 2746040,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "ABBV": {
    "symbol": "ABBV",
    "name": "AbbVie Inc.",
    "companyName": "AbbVie Inc.",
    "price": 224.81,
    "change": 0.46,
    "changesPercentage": 0.20504,
    "marketCap": 397324697800,
    "pe": 0,
    "pbr": 0,
    "dividend": 6.65,
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "ceo": "Robert A. Michael",
    "description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the worldwide. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behçet's diseases; SKYRIZI to treat moderate to severe plaque psoriasis in adults; RINVOQ, a JAK inhibitor for the treatment of moderate to severe active rheumatoid arthritis in adult patients; IMBRUVICA to treat adult patients with chronic lymphocytic leukemia (CLL), small lymphocytic lymphoma (SLL), and VENCLEXTA, a BCL-2 inhibitor used to treat adults with CLL or SLL; and MAVYRET to treat patients with chronic HCV genotype 1-6 infection. It also provides CREON, a pancreatic enzyme therapy for exocrine pancreatic insufficiency; Synthroid used in the treatment of hypothyroidism; Linzess/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; Lupron for the palliative treatment of advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; and Botox therapeutic. In addition, the company offers ORILISSA, a nonpeptide small molecule gonadotropin-releasing hormone antagonist for women with moderate to severe endometriosis pain; Duopa and Duodopa, a levodopa-carbidopa intestinal gel to treat Parkinson's disease; Lumigan/Ganfort, a bimatoprost ophthalmic solution for the reduction of elevated intraocular pressure (IOP) in patients with open angle glaucoma (OAG) or ocular hypertension; Ubrelvy to treat migraine with or without aura in adults; Alphagan/ Combigan, an alpha-adrenergic receptor agonist for the reduction of IOP in patients with OAG; and Restasis, a calcineurin inhibitor immunosuppressant to increase tear production, as well as other eye care products. AbbVie Inc. has a research collaboration with Dragonfly Therapeutics, Inc. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.",
    "exchange": "NYSE",
    "website": "https://www.abbvie.com",
    "image": "https://images.financialmodelingprep.com/symbol/ABBV.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 244.81,
    "yearLow": 164.39,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 6350688,
    "avgVolume": 6783220.4,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "PEP": {
    "symbol": "PEP",
    "name": "PepsiCo, Inc.",
    "companyName": "PepsiCo, Inc.",
    "price": 164.94,
    "change": 0.35,
    "changesPercentage": 0.21265,
    "marketCap": 225529078733,
    "pe": 0,
    "pbr": 0,
    "dividend": 5.6225,
    "sector": "Consumer Defensive",
    "industry": "Beverages - Non-Alcoholic",
    "ceo": "Ramon Luis Laguarta",
    "description": "PepsiCo, Inc. manufactures, markets, distributes, and sells various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, simply granola, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is headquartered in Purchase, New York.",
    "exchange": "NASDAQ",
    "website": "https://www.pepsico.com",
    "image": "https://images.financialmodelingprep.com/symbol/PEP.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 171.48,
    "yearLow": 127.6,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 4188630,
    "avgVolume": 8591691,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "KO": {
    "symbol": "KO",
    "name": "The Coca-Cola Company",
    "companyName": "The Coca-Cola Company",
    "price": 79.84,
    "change": 0.93,
    "changesPercentage": 1.17856,
    "marketCap": 343440542400,
    "pe": 0,
    "pbr": 0,
    "dividend": 2.04,
    "sector": "Consumer Defensive",
    "industry": "Beverages - Non-Alcoholic",
    "ceo": "James Robert Quincey",
    "description": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "exchange": "NYSE",
    "website": "https://www.coca-colacompany.com",
    "image": "https://images.financialmodelingprep.com/symbol/KO.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 80.41,
    "yearLow": 65.35,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 16026117,
    "avgVolume": 18206341,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "ADBE": {
    "symbol": "ADBE",
    "name": "Adobe Inc.",
    "companyName": "Adobe Inc.",
    "price": 258.61,
    "change": -0.6,
    "changesPercentage": -0.23147,
    "marketCap": 108254154793,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "ceo": "Shantanu Narayen",
    "description": "Adobe Inc. operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, workers, marketers, educators, enthusiasts, communicators, and consumers. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.",
    "exchange": "NASDAQ",
    "website": "https://www.adobe.com",
    "image": "https://images.financialmodelingprep.com/symbol/ADBE.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 464.33,
    "yearLow": 251.1,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 5797511,
    "avgVolume": 4903961,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "CRM": {
    "symbol": "CRM",
    "name": "Salesforce, Inc.",
    "companyName": "Salesforce, Inc.",
    "price": 185.16,
    "change": -0.13,
    "changesPercentage": -0.07016029,
    "marketCap": 176272306113,
    "pe": 0,
    "pbr": 0,
    "dividend": 1.664,
    "sector": "Technology",
    "industry": "Software - Application",
    "ceo": "Marc R. Benioff",
    "description": "Salesforce, Inc. provides customer relationship management technology that brings companies and customers together worldwide. Its Customer 360 platform empowers its customers to work together to deliver connected experiences for their customers. The company's service offerings include Sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and relationship intelligence, and deliver quotes, contracts, and invoices; and Service that enables companies to deliver trusted and highly personalized customer service and support at scale. Its service offerings also comprise flexible platform that enables companies of various sizes, locations, and industries to build business apps to bring them closer to their customers with drag-and-drop tools; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, a system of engagement. In addition, the company's service offerings include Marketing offering that enables companies to plan, personalize, and optimize one-to-one customer marketing journeys; and Commerce offering, which empowers brands to unify the customer experience across mobile, web, social, and store commerce points. Further, its service offerings comprise Tableau, an end-to-end analytics solution serving various enterprise use cases; and MuleSoft, an integration offering that allows its customers to unlock data across their enterprise. The company provides its service offering for customers in financial services, healthcare and life sciences, manufacturing, and other industries. It also offers professional services; and in-person and online courses to certify its customers and partners on architecting, administering, deploying, and developing its service offerings. The company provides its services through direct sales; and consulting firms, systems integrators, and other partners. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.",
    "exchange": "NYSE",
    "website": "https://www.salesforce.com",
    "image": "https://images.financialmodelingprep.com/symbol/CRM.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 329.74,
    "yearLow": 180.24,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 10640325,
    "avgVolume": 9947226,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "WMT": {
    "symbol": "WMT",
    "name": "Walmart Inc.",
    "companyName": "Walmart Inc.",
    "price": 122.99,
    "change": -1.88,
    "changesPercentage": -1.50557,
    "marketCap": 980581005739,
    "pe": 0,
    "pbr": 0,
    "dividend": 0.94,
    "sector": "Consumer Defensive",
    "industry": "Specialty Retail",
    "ceo": "John R. Furner",
    "description": "Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.",
    "exchange": "NASDAQ",
    "website": "https://corporate.walmart.com",
    "image": "https://images.financialmodelingprep.com/symbol/WMT.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 134.65,
    "yearLow": 79.81,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 34853514,
    "avgVolume": 30839795,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "BAC": {
    "symbol": "BAC",
    "name": "Bank of America Corporation",
    "companyName": "Bank of America Corporation",
    "price": 53.06,
    "change": 0.29,
    "changesPercentage": 0.54955,
    "marketCap": 387470449752,
    "pe": 0,
    "pbr": 0,
    "dividend": 1.08,
    "sector": "Financial Services",
    "industry": "Banks - Diversified",
    "ceo": "Brian Thomas Moynihan",
    "description": "Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. Its Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, noninterest-and interest-bearing checking accounts, and investment accounts and products; and credit and debit cards, residential mortgages, and home equity loans, as well as direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The company's Global Wealth & Investment Management segment offers investment management, brokerage, banking, and trust and retirement products and services; and wealth management solutions, as well as customized solutions, including specialty asset management services. Its Global Banking segment provides lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, and short-term investing options and merchant services; working capital management solutions; and debt and equity underwriting and distribution, and merger-related and other advisory services. The company's Global Markets segment offers market-making, financing, securities clearing, settlement, and custody services, as well as risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. As of December 31, 2021, it served approximately 67 million consumer and small business clients with approximately 4,200 retail financial centers; approximately 16,000 ATMs; and digital banking platforms with approximately 41 million active users. The company was founded in 1784 and is based in Charlotte, North Carolina.",
    "exchange": "NYSE",
    "website": "https://www.bankofamerica.com",
    "image": "https://images.financialmodelingprep.com/symbol/BAC.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 57.55,
    "yearLow": 33.07,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 32803849,
    "avgVolume": 39134304.7,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "NFLX": {
    "symbol": "NFLX",
    "name": "Netflix, Inc.",
    "companyName": "Netflix, Inc.",
    "price": 78.67,
    "change": 1.67,
    "changesPercentage": 2.16883,
    "marketCap": 333350227158,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Communication Services",
    "industry": "Entertainment",
    "ceo": "Theodore A. Sarandos",
    "description": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and mobile games across various genres and languages. The company provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services in the United States. The company has approximately 222 million paid members in 190 countries. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
    "exchange": "NASDAQ",
    "website": "https://www.netflix.com",
    "image": "https://images.financialmodelingprep.com/symbol/NFLX.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 134.115,
    "yearLow": 75.23,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 30688537,
    "avgVolume": 47461933,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "TMO": {
    "symbol": "TMO",
    "name": "Thermo Fisher Scientific Inc.",
    "companyName": "Thermo Fisher Scientific Inc.",
    "price": 510.93,
    "change": -4.19,
    "changesPercentage": -0.8134,
    "marketCap": 191960518585,
    "pe": 0,
    "pbr": 0,
    "dividend": 1.72,
    "sector": "Healthcare",
    "industry": "Medical - Diagnostics & Research",
    "ceo": "Marc N. Casper",
    "description": "Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.",
    "exchange": "NYSE",
    "website": "https://www.thermofisher.com",
    "image": "https://images.financialmodelingprep.com/symbol/TMO.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 643.99,
    "yearLow": 385.46,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 1311989,
    "avgVolume": 2133973,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  },
  "AMD": {
    "symbol": "AMD",
    "name": "Advanced Micro Devices, Inc.",
    "companyName": "Advanced Micro Devices, Inc.",
    "price": 200.15,
    "change": -3.22001,
    "changesPercentage": -1.58332,
    "marketCap": 326326561500,
    "pe": 0,
    "pbr": 0,
    "dividend": 0,
    "sector": "Technology",
    "industry": "Semiconductors",
    "ceo": "Lisa T. Su",
    "description": "Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides processors for desktop and notebook personal computers under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, and AMD PRO A-Series processors brands; discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics, AMD Embedded Radeon graphics brands; and professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands. It also offers Radeon Instinct, Radeon PRO V-series, and AMD Instinct accelerators for servers; chipsets under the AMD trademark; microprocessors for servers under the AMD EPYC; embedded processor solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. The company was incorporated in 1969 and is headquartered in Santa Clara, California.",
    "exchange": "NASDAQ",
    "website": "https://www.amd.com",
    "image": "https://images.financialmodelingprep.com/symbol/AMD.png",
    "dayLow": 0,
    "dayHigh": 0,
    "yearHigh": 267.08,
    "yearLow": 76.48,
    "priceAvg50": 0,
    "priceAvg200": 0,
    "volume": 34761240,
    "avgVolume": 37310808,
    "open": 0,
    "previousClose": 0,
    "eps": 0,
    "sharesOutstanding": 0,
    "timestamp": 0
  }
}